; domain
(define (domain lunar)
(:predicates 	(at ?place)
		(in ?item ?place)
		(has ?item)
		(experiment ?place))

(:action navigate 	:parameters (?placefrom ?placeto)
			:precondition 	(and (at ?placefrom)
					     (not (at ?placeto)))
			:effect 	(and (at ?placeto)
					     (not (at ?placefrom))) )

(:action pickup 	:parameters (?item ?place) 
			:precondition 	(and (at ?place)
					     (in ?item ?place))
			:effect 	(and (not (in ?item ?place))
					     (has ?item)) )

(:action dropoff 	:parameters (?item ?place)
			:precondition 	(and (at ?place)
					     (has ?item))
			:effect 	(and (not (has ?item))
					     (in ?item ?place)) )

(:action science 	:parameters (?place)
			:precondition 	(and (at ?place)
					     (not (experiment ?place)))
			:effect		(experiment ?place) ) )

; problem
(define (problem pb1)
(:domain lunar)

(:objects 	site_a site_b site_c 
		cargo_a cargo_b)

(:init 		(in cargo_a site_a)
		(in cargo_b site_b)
		(at site_a))

(:goal		(and (in cargo_a site_b) (experiment site_c))))

; plan
1. (navigate site_a site_c)
   deleted: (at site_a)
   added: (at site_c)
   goals met: 0 of 2
2. (science site_c)
   added: (experiment site_c)
   goals met: 1 of 2
3. (navigate site_c site_a)
   deleted: (at site_c)
   added: (at site_a)
   goals met: 1 of 2
4. (pickup cargo_a site_a)
   deleted: (in cargo_a site_a)
   added: (has cargo_a)
   goals met: 1 of 2
5. (navigate site_a site_b)
   deleted: (at site_a)
   added: (at site_b)
   goals met: 1 of 2
6. (dropoff cargo_a site_b)
   deleted: (has cargo_a)
   added: (in cargo_a site_b)
   goals met: 2 of 2
